{
    "authors": [
        "Alicia Victoria Lozano",
        "Alicia Victoria Lozano Is A California-Based Reporter For Nbc News Focusing On Climate Change",
        "Wildfires",
        "The Changing Politics Of Drug Laws."
    ],
    "date_download": "2021-03-21 17:43:46",
    "date_modify": null,
    "date_publish": "2021-03-21 01:36:00",
    "description": "People across the U.S. participated in rallies Saturday to protest hate against Asian Americans following the deadly spa shootings in Atlanta.",
    "filename": "https%3A%2F%2Fwww.nbcnews.com%2Fnews%2Fus-news%2Fpeople-across-u-s-protest-anti-asian-hate-following-deadly-n1261677.json",
    "image_url": "https://media1.s-nbcnews.com/j/newscms/2021_11/3458472/200320-anti-asian-hate-rally-axc-927p_a4b6950c494eca2786ed4708b7cc9622.nbcnews-fp-1200-630.JPG",
    "language": "en",
    "localpath": null,
    "maintext": "People across the U.S. participated in rallies Saturday to condemn attacks against Asian Americans and Pacific Islanders after the shooting rampage in Atlanta that left eight people dead.\nFrom San Francisco to Pittsburgh and points in between, men, women and children marched and spoke out against the surge in hate crimes on members of the AAPI community, which came to a head Tuesday when a shooter targeted three Atlanta-area spas. Six of those killed were women of Asian descent.\n\"I've dealt with words and looks and stuff my whole life,\" Ann Johns told NBC News at an Atlanta rally. \"My family doesn't want me to go anywhere by myself.\"\nIn San Antonio, Texas, former Mayor Juliàn Castro told demonstrators the United States has an \"imperfect\" history that warrants examining.\n\"We must stop hate against Asian Americans in this country,\" said Castro, former Secretary of Housing and Urban Development in the Obama administration. \"For generations, Asian Americans have been discriminated against. I don't have to tell that to anybody in this crowd.\"\nBetty Wu, center, of Bellevue, Pa., and her children, Timmy, 3, and Kayley, 5, hold signs and listen to a speaker during a \"Stop Asian Hate\" rally to protest the recent surge in hate crimes against Asian Americans on Saturday in Pittsburgh. Alexandra Wimley / AP\nIn Pittsburgh, actor Sandra Oh told protesters that she is \"proud to be Asian,\" NBC affiliate WXPI reported.\n“For many of us in our community, this is the first time we are able to voice our fear and anger, and I am so grateful for everyone willing to listen,” Oh said.\nIn Chicago, a marcher in the Logan Square neighborhood told NBC Chicago they came out not only to show support for the victims of Tuesday's shootings but to prevent such attacks in the future.\n\"I come here, I think of not only for me but also for my next generation,\" demonstrator Dai Quing said. \"I think they should have the same opportunity and be respected equal.\"\nResearch released this weekby the reporting forum Stop AAPI Hate revealed nearly 3,800 incidents over the course of roughly a year against people of Asian descent. Women made up a far higher share of the reports, at 68 percent, compared to men, who made up 29 percent of respondents.\nA day after the Atlanta shootings, a 75-year-old woman in San Francisco was viciously assaulted while walking down the street. Xiao Zhen Xie suffered two black eyes and was struggling to see out of her right eye. She appeared to have fought back.\nSan Francisco police Capt. Julian Ng said his department will increase its presence in Asian neighborhoods to help soothe community fears.\n\"Hate can have no safe harbor in American,\" President Joe Biden said earlier this week during a trip to Atlanta. \"It must stop.\"\nVice President Kamala Harris, who is of South Asian descent, added that \"racism is real in America and it has always been.\"",
    "source_domain": "www.nbcnews.com",
    "title": "People across U.S. protest anti-Asian hate following deadly spa shootings",
    "title_page": null,
    "title_rss": null,
    "url": "https://www.nbcnews.com/news/us-news/people-across-u-s-protest-anti-asian-hate-following-deadly-n1261677"
}